can-make-arithmetic-progression/README.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-05-14 Wed 11:50 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>README</title>
<meta name="author" content="George Mauer" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">README</h1>
<p>
A lot of jobs are talking about Go now, I guess lets try Go.
</p>

<p>
Pulling a problem from an old #daily-programmer post
</p>
<div id="outline-container-org128775e" class="outline-2">
<h2 id="org128775e"><span class="section-number-2">1.</span> Problem Statement - Can make arithmetic progression from sequence</h2>
<div class="outline-text-2" id="text-1">
<p>
A sequence of numbers is called an arithemtic progression if the difference between any two consecutive elements is the same. Given an array of numbers <code>arr</code>. return <code>true</code> if the array can be rearranged to form an arithmetic progression. Otherwise return <code>false</code>.
</p>
</div>
<div id="outline-container-orgb03c51e" class="outline-3">
<h3 id="orgb03c51e"><span class="section-number-3">1.1.</span> Example 1</h3>
<div class="outline-text-3" id="text-1-1">
<dl class="org-dl">
<dt>Input</dt><dd><code>3 5 1</code></dd>
<dt>Output</dt><dd><code>true</code></dd>
</dl>
</div>
</div>
<div id="outline-container-org5dcdd9d" class="outline-3">
<h3 id="org5dcdd9d"><span class="section-number-3">1.2.</span> Example 2</h3>
<div class="outline-text-3" id="text-1-2">
<dl class="org-dl">
<dt>Input</dt><dd><code>1 2 4</code></dd>
<dt>Output</dt><dd><code>false</code></dd>
</dl>
</div>
</div>
<div id="outline-container-orgdcf08d0" class="outline-3">
<h3 id="orgdcf08d0"><span class="section-number-3">1.3.</span> Constraints</h3>
<div class="outline-text-3" id="text-1-3">
<ul class="org-ul">
<li><code>2 &lt;= input.length &lt;= 1000</code></li>
<li><code>-100 &lt;= input[i] &lt;= 100</code></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org3620300" class="outline-2">
<h2 id="org3620300"><span class="section-number-2">2.</span> Brainstorming</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-orgf4b9b14" class="outline-3">
<h3 id="orgf4b9b14"><span class="section-number-3">2.1.</span> As Streams</h3>
<div class="outline-text-3" id="text-2-1">
<p>
I mean&#x2026;you could do this DFS, I suppose. This is really a stream sort of situation
</p>

<p>
There's a stream for evaluating if a given sequence is an arithmetic progression
</p>
<ul class="org-ul">
<li>One stream that produces numbers in a given order</li>
<li>A transform that calculates deltas</li>
<li>A short circuit where if any delta is not equal to the previous one, then the whole thing returns false</li>
<li>if the stream terminates the whole thing return true</li>
</ul>

<p>
And another stream for generating all possible sequences
</p>
<ul class="org-ul">
<li>using DFS</li>
<li>if any one sequence is an arithmetic progression, then return true</li>
<li>if all sequences were checked, then return false</li>
</ul>


<p>
This actually sounds like a go routine and a go channel sort of thing
</p>

<p>
Ok so lets get a feel for channels
</p>
</div>
</div>
<div id="outline-container-org6678efa" class="outline-3">
<h3 id="org6678efa"><span class="section-number-3">2.2.</span> Learning Go Channels</h3>
<div class="outline-text-3" id="text-2-2">
<p>
Let's grab an example from mistral.
</p>

<div class="org-src-container">
<pre class="src src-go" id="orgf267f06"><span style="color: #4f97d7; font-weight: bold;">package</span> main

<span style="color: #4f97d7; font-weight: bold;">import</span> <span style="color: #4f97d7;">(</span>
  <span style="color: #2d9574;">"fmt"</span>
  <span style="color: #2d9574;">"time"</span>
<span style="color: #4f97d7;">)</span>

<span style="color: #4f97d7; font-weight: bold;">func</span> <span style="color: #bc6ec5; font-weight: bold;">sendValues</span><span style="color: #4f97d7;">(</span><span style="color: #7590db;">c</span> <span style="color: #4f97d7; font-weight: bold;">chan</span><span style="color: #4f97d7; font-weight: bold;">&lt;-</span> <span style="color: #ce537a; font-weight: bold;">int</span><span style="color: #4f97d7;">)</span> <span style="color: #4f97d7;">{</span>
  <span style="color: #4f97d7; font-weight: bold;">for</span> <span style="color: #7590db;">i</span> <span style="color: #4f97d7; font-weight: bold;">:=</span> <span style="color: #a45bad;">0</span>; <span style="color: #7590db;">i</span> <span style="color: #4f97d7; font-weight: bold;">&lt;</span> <span style="color: #a45bad;">5</span>; <span style="color: #7590db;">i</span><span style="color: #4f97d7; font-weight: bold;">++</span> <span style="color: #bc6ec5;">{</span>
    <span style="color: #7590db;">c</span> <span style="color: #4f97d7; font-weight: bold;">&lt;-</span> <span style="color: #7590db;">i</span>
    <span style="color: #7590db;">time</span>.<span style="color: #2aa1ae; font-weight: bold; font-style: italic;">Sleep</span><span style="color: #2d9574;">(</span><span style="color: #a45bad;">100</span> <span style="color: #4f97d7; font-weight: bold;">*</span> <span style="color: #7590db;">time</span>.<span style="color: #a45bad; font-style: italic;">Millisecond</span><span style="color: #2d9574;">)</span>
  <span style="color: #bc6ec5;">}</span>
  <span style="color: #4f97d7; font-weight: bold;">close</span><span style="color: #bc6ec5;">(</span><span style="color: #7590db;">c</span><span style="color: #bc6ec5;">)</span>
<span style="color: #4f97d7;">}</span>

<span style="color: #4f97d7; font-weight: bold;">func</span> <span style="color: #bc6ec5; font-weight: bold;">receiveValues</span><span style="color: #4f97d7;">(</span><span style="color: #7590db;">c</span> <span style="color: #4f97d7; font-weight: bold;">&lt;-</span><span style="color: #4f97d7; font-weight: bold;">chan</span> <span style="color: #ce537a; font-weight: bold;">int</span><span style="color: #4f97d7;">)</span> <span style="color: #4f97d7;">{</span>
  <span style="color: #4f97d7; font-weight: bold;">for</span> <span style="color: #7590db;">value</span> <span style="color: #4f97d7; font-weight: bold;">:=</span> <span style="color: #4f97d7; font-weight: bold;">range</span> <span style="color: #7590db;">c</span> <span style="color: #bc6ec5;">{</span>
    <span style="color: #7590db;">fmt</span>.<span style="color: #2aa1ae; font-weight: bold; font-style: italic;">Println</span><span style="color: #2d9574;">(</span><span style="color: #2d9574;">"Received:"</span>, <span style="color: #7590db;">value</span><span style="color: #2d9574;">)</span>
  <span style="color: #bc6ec5;">}</span>
<span style="color: #4f97d7;">}</span>

<span style="color: #4f97d7; font-weight: bold;">func</span> <span style="color: #bc6ec5; font-weight: bold;">arithmetic_progression</span><span style="color: #4f97d7;">()</span> <span style="color: #4f97d7;">{</span>
  <span style="color: #7590db;">ch</span> <span style="color: #4f97d7; font-weight: bold;">:=</span> <span style="color: #4f97d7; font-weight: bold;">make</span><span style="color: #bc6ec5;">(</span><span style="color: #4f97d7; font-weight: bold;">chan</span> <span style="color: #ce537a; font-weight: bold;">int</span>, <span style="color: #7590db;">bufferSize</span><span style="color: #bc6ec5;">)</span>
  <span style="color: #4f97d7; font-weight: bold;">go</span> <span style="color: #2aa1ae; font-weight: bold;">sendValues</span><span style="color: #bc6ec5;">(</span><span style="color: #7590db;">ch</span><span style="color: #bc6ec5;">)</span>
  <span style="color: #2aa1ae; font-weight: bold;">receiveValues</span><span style="color: #bc6ec5;">(</span><span style="color: #7590db;">ch</span><span style="color: #bc6ec5;">)</span>
<span style="color: #4f97d7;">}</span>
</pre>
</div>

<p>
I see, so it looks like you get bufferred delivery, what happens if you call it with bufferring disabled?
</p>

<p>
Same deal, so in this case it really didn't matter, they just ran sequentially similar to javascript's <code>defer</code> behavior I imagine. I'm sure there's a way to parallelize from there. Beyond that, it is just a matter of learning some syntax.
</p>
</div>
</div>
