can-make-arithmetic-progression/README.md
A lot of jobs are talking about Go now, I guess lets try Go.

Pulling a problem from an old #daily-programmer post


# Problem Statement - Can make arithmetic progression from sequence

A sequence of numbers is called an arithemtic progression if the difference between any two consecutive elements is the same. Given an array of numbers `arr`. return `true` if the array can be rearranged to form an arithmetic progression. Otherwise return `false`.


## Example 1

-   **Input:** `3 5 1`
-   **Output:** `true`


## Example 2

-   **Input:** `1 2 4`
-   **Output:** `false`


## Constraints

-   `2 <= input.length <= 1000`
-   `-100 <= input[i] <= 100`


# Brainstorming


## As Streams

I mean&#x2026;you could do this DFS, I suppose. This is really a stream sort of situation

There's a stream for evaluating if a given sequence is an arithmetic progression

-   One stream that produces numbers in a given order
-   A transform that calculates deltas
-   A short circuit where if any delta is not equal to the previous one, then the whole thing returns false
-   if the stream terminates the whole thing return true

And another stream for generating all possible sequences

-   using DFS
-   if any one sequence is an arithmetic progression, then return true
-   if all sequences were checked, then return false

This actually sounds like a go routine and a go channel sort of thing

Ok so lets get a feel for channels


## Learning Go Channels

Let's grab an example from mistral.

    package main
    
    import (
      "fmt"
      "time"
    )
    
    func sendValues(c chan<- int) {
      for i := 0; i < 5; i++ {
        c <- i
        time.Sleep(100 * time.Millisecond)
      }
      close(c)
    }
    
    func receiveValues(c <-chan int) {
      for value := range c {
        fmt.Println("Received:", value)
      }
    }
    
    func arithmetic_progression() {
      ch := make(chan int, bufferSize)
      go sendValues(ch)
      receiveValues(ch)
    }

I see, so it looks like you get bufferred delivery, what happens if you call it with bufferring disabled?

Same deal, so in this case it really didn't matter, they just ran sequentially similar to javascript's `defer` behavior I imagine. I'm sure there's a way to parallelize from there. Beyond that, it is just a matter of learning some syntax.
