can-make-arithmetic-progression/README.org
** Essence of the problem
As I think about it more, that is quite a lot of permutations that you might have to check.

for an input of size ~2~ there is only up to =1= permutation to try as the answer to *all* permutations that they are, in fact, arithmetic progressions of 1.

What about for an input the size of ~3~? Lets consider the possible positions


| Permutation | Is AP? |
| 1 2 3       | X      |
| 1 3 2       |        |
| 2 1 3       |        |
| 2 3 1       |        |
| 3 1 2       |        |
| 3 2 1       | X      |

So hold on...that is a good point. If you just sort the list can it not be a simple scan to see if each subsequent delta is the same? Are there counter-examples where sorting is not the only answer?

I'm thinking about something that bounces betweens positive and negative. But no, that doesn't make sense. If you think about it, if you were to chart out any algorithmic progression it would have to have a constant, monotonic slope. But anything with negatives and positive mixed would contain not only not the same slope but a slope in the opposite direction. The same argument could be made for why it *has* to be a sorted list since an out-of-sort-order list's derivative chart could would not be monotonic.

To speak to performance, I know that in just about any language that a sort of 999 items is nearly instantaneous so even if there's further improvements possible, this approach should fit within our constraints very nicely.

So maybe the solution isn't all that perfect a fit for go channels...we need only to sort with a builtin then walk the sorted list to see if any two are differnt

* Implementation
:PROPERTIES:
:header-args+: :noweb strip-export
:header-args+: :exports both
:header-args:go+: :mkdirp 't :comments both
:header-args:go+: :main no
:END:

** Simple Implementation
:PROPERTIES:
:header-args:go+: :tangle arithmetic_progression.go
:END:

Ok lets do it based on the deeper insight above. It becomes quite simple

#+begin_src go
  package main


  import (
    "fmt"
    "slices"
  )

  func isArithmeticProgression(array []int) bool {
    if len(array) <= 2 {
      return true
    }

    sortedArray := slices.Clone(array)
    slices.Sort(sortedArray)

    prevItem := sortedArray[1]
    prevGap := prevItem - sortedArray[0]

    for _, item := range sortedArray[2:] {
      newGap := item - prevItem
      if newGap != prevGap {
        return false
      }
      prevGap = newGap
      prevItem = item
    }

    return true
  }

  func arithmetic_progression() {
    fmt.Println(isArithmeticProgression([]int{3, 5, 1}))
    fmt.Println(isArithmeticProgression([]int{1, 2, 4}))
  }
#+end_src

#+RESULTS:
: true
: false


