can-make-arithmetic-progression/README.html
<div id="outline-container-org6f803c2" class="outline-3">
<h3 id="org6f803c2"><span class="section-number-3">2.3.</span> Essence of the problem</h3>
<div class="outline-text-3" id="text-2-3">
<p>
As I think about it more, that is quite a lot of permutations that you might have to check.
</p>

<p>
for an input of size <code>2</code> there is only up to <code>1</code> permutation to try as the answer to <b>all</b> permutations that they are, in fact, arithmetic progressions of 1.
</p>

<p>
What about for an input the size of <code>3</code>? Lets consider the possible positions
</p>


<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">Permutation</td>
<td class="org-left">Is AP?</td>
</tr>

<tr>
<td class="org-left">1 2 3</td>
<td class="org-left">X</td>
</tr>

<tr>
<td class="org-left">1 3 2</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">2 1 3</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">2 3 1</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">3 1 2</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">3 2 1</td>
<td class="org-left">X</td>
</tr>
</tbody>
</table>

<p>
So hold on&#x2026;that is a good point. If you just sort the list can it not be a simple scan to see if each subsequent delta is the same? Are there counter-examples where sorting is not the only answer?
</p>

<p>
I'm thinking about something that bounces betweens positive and negative. But no, that doesn't make sense. If you think about it, if you were to chart out any algorithmic progression it would have to have a constant, monotonic slope. But anything with negatives and positive mixed would contain not only not the same slope but a slope in the opposite direction. The same argument could be made for why it <b>has</b> to be a sorted list since an out-of-sort-order list's derivative chart could would not be monotonic.
</p>

<p>
To speak to performance, I know that in just about any language that a sort of 999 items is nearly instantaneous so even if there's further improvements possible, this approach should fit within our constraints very nicely.
</p>

<p>
So maybe the solution isn't all that perfect a fit for go channels&#x2026;we need only to sort with a builtin then walk the sorted list to see if any two are differnt
</p>
</div>
</div>
</div>
<div id="outline-container-org50ef5a3" class="outline-2">
<h2 id="org50ef5a3"><span class="section-number-2">3.</span> Implementation</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-orgb8490c4" class="outline-3">
<h3 id="orgb8490c4"><span class="section-number-3">3.1.</span> Simple Implementation</h3>
<div class="outline-text-3" id="text-3-1">
<p>
Ok lets do it based on the deeper insight above. It becomes quite simple
</p>

<div class="org-src-container">
<pre class="src src-go"><span style="color: #4f97d7; font-weight: bold;">package</span> main


<span style="color: #4f97d7; font-weight: bold;">import</span> <span style="color: #4f97d7;">(</span>
  <span style="color: #2d9574;">"fmt"</span>
  <span style="color: #2d9574;">"slices"</span>
<span style="color: #4f97d7;">)</span>

<span style="color: #4f97d7; font-weight: bold;">func</span> <span style="color: #bc6ec5; font-weight: bold;">isArithmeticProgression</span><span style="color: #4f97d7;">(</span><span style="color: #7590db;">array</span> <span style="color: #bc6ec5;">[]</span><span style="color: #ce537a; font-weight: bold;">int</span><span style="color: #4f97d7;">)</span> <span style="color: #ce537a; font-weight: bold;">bool</span> <span style="color: #4f97d7;">{</span>
  <span style="color: #4f97d7; font-weight: bold;">if</span> <span style="color: #4f97d7; font-weight: bold;">len</span><span style="color: #bc6ec5;">(</span><span style="color: #7590db;">array</span><span style="color: #bc6ec5;">)</span> <span style="color: #4f97d7; font-weight: bold;">&lt;=</span> <span style="color: #a45bad;">2</span> <span style="color: #bc6ec5;">{</span>
    <span style="color: #4f97d7; font-weight: bold;">return</span> <span style="color: #4f97d7;">true</span>
  <span style="color: #bc6ec5;">}</span>

  <span style="color: #7590db;">sortedArray</span> <span style="color: #4f97d7; font-weight: bold;">:=</span> <span style="color: #7590db;">slices</span>.<span style="color: #2aa1ae; font-weight: bold; font-style: italic;">Clone</span><span style="color: #bc6ec5;">(</span><span style="color: #7590db;">array</span><span style="color: #bc6ec5;">)</span>
  <span style="color: #7590db;">slices</span>.<span style="color: #2aa1ae; font-weight: bold; font-style: italic;">Sort</span><span style="color: #bc6ec5;">(</span><span style="color: #7590db;">sortedArray</span><span style="color: #bc6ec5;">)</span>

  <span style="color: #7590db;">prevItem</span> <span style="color: #4f97d7; font-weight: bold;">:=</span> <span style="color: #7590db;">sortedArray</span><span style="color: #bc6ec5;">[</span><span style="color: #a45bad;">1</span><span style="color: #bc6ec5;">]</span>
  <span style="color: #7590db;">prevGap</span> <span style="color: #4f97d7; font-weight: bold;">:=</span> <span style="color: #7590db;">prevItem</span> <span style="color: #4f97d7; font-weight: bold;">-</span> <span style="color: #7590db;">sortedArray</span><span style="color: #bc6ec5;">[</span><span style="color: #a45bad;">0</span><span style="color: #bc6ec5;">]</span>

  <span style="color: #4f97d7; font-weight: bold;">for</span> <span style="color: #7590db;">_</span>, <span style="color: #7590db;">item</span> <span style="color: #4f97d7; font-weight: bold;">:=</span> <span style="color: #4f97d7; font-weight: bold;">range</span> <span style="color: #7590db;">sortedArray</span><span style="color: #bc6ec5;">[</span><span style="color: #a45bad;">2</span>:<span style="color: #bc6ec5;">]</span> <span style="color: #bc6ec5;">{</span>
    <span style="color: #7590db;">newGap</span> <span style="color: #4f97d7; font-weight: bold;">:=</span> <span style="color: #7590db;">item</span> <span style="color: #4f97d7; font-weight: bold;">-</span> <span style="color: #7590db;">prevItem</span>
    <span style="color: #4f97d7; font-weight: bold;">if</span> <span style="color: #7590db;">newGap</span> <span style="color: #4f97d7; font-weight: bold;">!=</span> <span style="color: #7590db;">prevGap</span> <span style="color: #2d9574;">{</span>
      <span style="color: #4f97d7; font-weight: bold;">return</span> <span style="color: #4f97d7;">false</span>
    <span style="color: #2d9574;">}</span>
    <span style="color: #7590db;">prevGap</span> <span style="color: #4f97d7; font-weight: bold;">=</span> <span style="color: #7590db;">newGap</span>
    <span style="color: #7590db;">prevItem</span> <span style="color: #4f97d7; font-weight: bold;">=</span> <span style="color: #7590db;">item</span>
  <span style="color: #bc6ec5;">}</span>

  <span style="color: #4f97d7; font-weight: bold;">return</span> <span style="color: #4f97d7;">true</span>
<span style="color: #4f97d7;">}</span>

<span style="color: #4f97d7; font-weight: bold;">func</span> <span style="color: #bc6ec5; font-weight: bold;">arithmetic_progression</span><span style="color: #4f97d7;">()</span> <span style="color: #4f97d7;">{</span>
  <span style="color: #7590db;">fmt</span>.<span style="color: #2aa1ae; font-weight: bold; font-style: italic;">Println</span><span style="color: #bc6ec5;">(</span><span style="color: #2aa1ae; font-weight: bold;">isArithmeticProgression</span><span style="color: #2d9574;">(</span><span style="color: #67b11d;">[]</span><span style="color: #ce537a; font-weight: bold;">int</span><span style="color: #67b11d;">{</span><span style="color: #a45bad;">3</span>, <span style="color: #a45bad;">5</span>, <span style="color: #a45bad;">1</span><span style="color: #67b11d;">}</span><span style="color: #2d9574;">)</span><span style="color: #bc6ec5;">)</span>
  <span style="color: #7590db;">fmt</span>.<span style="color: #2aa1ae; font-weight: bold; font-style: italic;">Println</span><span style="color: #bc6ec5;">(</span><span style="color: #2aa1ae; font-weight: bold;">isArithmeticProgression</span><span style="color: #2d9574;">(</span><span style="color: #67b11d;">[]</span><span style="color: #ce537a; font-weight: bold;">int</span><span style="color: #67b11d;">{</span><span style="color: #a45bad;">1</span>, <span style="color: #a45bad;">2</span>, <span style="color: #a45bad;">4</span><span style="color: #67b11d;">}</span><span style="color: #2d9574;">)</span><span style="color: #bc6ec5;">)</span>
<span style="color: #4f97d7;">}</span>
</pre>
</div>
</div>
</div>
