can-make-arithmetic-progression/README.html
<div id="outline-container-org5d3194f" class="outline-3">
<h3 id="org5d3194f"><span class="section-number-3">3.2.</span> Simple implementation tests</h3>
<div class="outline-text-3" id="text-3-2">
<p>
Lets write some tests
</p>
<div class="org-src-container">
<pre class="src src-go"><span style="color: #4f97d7; font-weight: bold;">package</span> main

<span style="color: #4f97d7; font-weight: bold;">import</span> <span style="color: #4f97d7;">(</span>
  <span style="color: #2d9574;">"testing"</span>
<span style="color: #4f97d7;">)</span>

<span style="color: #4f97d7; font-weight: bold;">func</span> <span style="color: #bc6ec5; font-weight: bold;">TestIsArithmeticProgression</span><span style="color: #4f97d7;">(</span><span style="color: #7590db;">t</span> <span style="color: #4f97d7; font-weight: bold;">*</span>testing.<span style="color: #ce537a; font-weight: bold;">T</span><span style="color: #4f97d7;">)</span> <span style="color: #4f97d7;">{</span>
  <span style="color: #7590db;">testCases</span> <span style="color: #4f97d7; font-weight: bold;">:=</span> <span style="color: #bc6ec5;">[]</span><span style="color: #4f97d7; font-weight: bold;">struct</span> <span style="color: #bc6ec5;">{</span>
    <span style="color: #a45bad; font-style: italic;">name</span>     <span style="color: #ce537a; font-weight: bold;">string</span>
    <span style="color: #a45bad; font-style: italic;">input</span>    <span style="color: #2d9574;">[]</span><span style="color: #ce537a; font-weight: bold;">int</span>
    <span style="color: #a45bad; font-style: italic;">expected</span> <span style="color: #ce537a; font-weight: bold;">bool</span>
  <span style="color: #bc6ec5;">}{</span>
    <span style="color: #2d9574;">{</span><span style="color: #2d9574;">"Example 1 - Valid progression"</span>, <span style="color: #67b11d;">[]</span><span style="color: #ce537a; font-weight: bold;">int</span><span style="color: #67b11d;">{</span><span style="color: #a45bad;">3</span>, <span style="color: #a45bad;">5</span>, <span style="color: #a45bad;">1</span><span style="color: #67b11d;">}</span>, <span style="color: #4f97d7;">true</span><span style="color: #2d9574;">}</span>,
    <span style="color: #2d9574;">{</span><span style="color: #2d9574;">"Example 2 - Invalid progression"</span>, <span style="color: #67b11d;">[]</span><span style="color: #ce537a; font-weight: bold;">int</span><span style="color: #67b11d;">{</span><span style="color: #a45bad;">1</span>, <span style="color: #a45bad;">2</span>, <span style="color: #a45bad;">4</span><span style="color: #67b11d;">}</span>, <span style="color: #4f97d7;">false</span><span style="color: #2d9574;">}</span>,
    <span style="color: #2d9574;">{</span><span style="color: #2d9574;">"Empty array"</span>, <span style="color: #67b11d;">[]</span><span style="color: #ce537a; font-weight: bold;">int</span><span style="color: #67b11d;">{}</span>, <span style="color: #4f97d7;">true</span><span style="color: #2d9574;">}</span>,
    <span style="color: #2d9574;">{</span><span style="color: #2d9574;">"Single element"</span>, <span style="color: #67b11d;">[]</span><span style="color: #ce537a; font-weight: bold;">int</span><span style="color: #67b11d;">{</span><span style="color: #a45bad;">5</span><span style="color: #67b11d;">}</span>, <span style="color: #4f97d7;">true</span><span style="color: #2d9574;">}</span>,
    <span style="color: #2d9574;">{</span><span style="color: #2d9574;">"Two elements"</span>, <span style="color: #67b11d;">[]</span><span style="color: #ce537a; font-weight: bold;">int</span><span style="color: #67b11d;">{</span><span style="color: #a45bad;">1</span>, <span style="color: #a45bad;">2</span><span style="color: #67b11d;">}</span>, <span style="color: #4f97d7;">true</span><span style="color: #2d9574;">}</span>,
    <span style="color: #2d9574;">{</span><span style="color: #2d9574;">"Negative numbers"</span>, <span style="color: #67b11d;">[]</span><span style="color: #ce537a; font-weight: bold;">int</span><span style="color: #67b11d;">{</span><span style="color: #4f97d7; font-weight: bold;">-</span><span style="color: #a45bad;">3</span>, <span style="color: #4f97d7; font-weight: bold;">-</span><span style="color: #a45bad;">1</span>, <span style="color: #a45bad;">1</span><span style="color: #67b11d;">}</span>, <span style="color: #4f97d7;">true</span><span style="color: #2d9574;">}</span>,
    <span style="color: #2d9574;">{</span><span style="color: #2d9574;">"Same numbers"</span>, <span style="color: #67b11d;">[]</span><span style="color: #ce537a; font-weight: bold;">int</span><span style="color: #67b11d;">{</span><span style="color: #a45bad;">2</span>, <span style="color: #a45bad;">2</span>, <span style="color: #a45bad;">2</span>, <span style="color: #a45bad;">2</span><span style="color: #67b11d;">}</span>, <span style="color: #4f97d7;">true</span><span style="color: #2d9574;">}</span>,
  <span style="color: #bc6ec5;">}</span>

  <span style="color: #4f97d7; font-weight: bold;">for</span> <span style="color: #7590db;">_</span>, <span style="color: #7590db;">tc</span> <span style="color: #4f97d7; font-weight: bold;">:=</span> <span style="color: #4f97d7; font-weight: bold;">range</span> <span style="color: #7590db;">testCases</span> <span style="color: #bc6ec5;">{</span>
    <span style="color: #7590db;">t</span>.<span style="color: #2aa1ae; font-weight: bold; font-style: italic;">Run</span><span style="color: #2d9574;">(</span><span style="color: #7590db;">tc</span>.<span style="color: #a45bad; font-style: italic;">name</span>, <span style="color: #4f97d7; font-weight: bold;">func</span><span style="color: #67b11d;">(</span><span style="color: #7590db;">t</span> <span style="color: #4f97d7; font-weight: bold;">*</span>testing.<span style="color: #ce537a; font-weight: bold;">T</span><span style="color: #67b11d;">)</span> <span style="color: #67b11d;">{</span>
      <span style="color: #7590db;">result</span> <span style="color: #4f97d7; font-weight: bold;">:=</span> <span style="color: #2aa1ae; font-weight: bold;">isArithmeticProgression</span><span style="color: #b1951d;">(</span><span style="color: #7590db;">tc</span>.<span style="color: #a45bad; font-style: italic;">input</span><span style="color: #b1951d;">)</span>
      <span style="color: #4f97d7; font-weight: bold;">if</span> <span style="color: #7590db;">result</span> <span style="color: #4f97d7; font-weight: bold;">!=</span> <span style="color: #7590db;">tc</span>.<span style="color: #a45bad; font-style: italic;">expected</span> <span style="color: #b1951d;">{</span>
        <span style="color: #7590db;">t</span>.<span style="color: #2aa1ae; font-weight: bold; font-style: italic;">Errorf</span><span style="color: #4f97d7;">(</span><span style="color: #2d9574;">"isArithmeticProgression(%v) = %v; want %v"</span>, <span style="color: #7590db;">tc</span>.<span style="color: #a45bad; font-style: italic;">input</span>, <span style="color: #7590db;">result</span>, <span style="color: #7590db;">tc</span>.<span style="color: #a45bad; font-style: italic;">expected</span><span style="color: #4f97d7;">)</span>
      <span style="color: #b1951d;">}</span>
    <span style="color: #67b11d;">}</span><span style="color: #2d9574;">)</span>
  <span style="color: #bc6ec5;">}</span>
<span style="color: #4f97d7;">}</span>
</pre>
</div>

<p>
We can then run this like this
</p>
<div class="org-src-container">
<pre class="src src-shell"><span style="color: #2aa1ae; font-weight: bold;">go</span> test 
</pre>
</div>

<pre class="example">
PASS
ok  	github.com/user/can-make-arithmetic-progression	0.002s
</pre>
</div>
</div>
