can-make-arithmetic-progression/README.html
<div id="outline-container-orgc6323c2" class="outline-3">
<h3 id="orgc6323c2"><span class="section-number-3">3.3.</span> Using channels</h3>
<div class="outline-text-3" id="text-3-3">
<p>
Ok, so hear me out, the above works just fine of course, but in other languages I would be using a generator or a stream to calculate the stream of deltas which I could then just compare one after the other, perhaps even generating another generator. With Go, the equivalent is to use channels. <a href="https://stackoverflow.com/a/34466755/5056">Because of the semantics around closing them</a> hover it's not so straightforward and has higher overhead. Still, I would like to try and implement it as a learning exercise.
</p>

<p>
First some standard imports
</p>

<div class="org-src-container">
<pre class="src src-go" id="org48ea378"><span style="color: #4f97d7; font-weight: bold;">package</span> main

<span style="color: #4f97d7; font-weight: bold;">import</span> <span style="color: #4f97d7;">(</span>
  <span style="color: #2d9574;">"fmt"</span>
  <span style="color: #2d9574;">"slices"</span>
<span style="color: #4f97d7;">)</span>

<span style="color: #4f97d7; font-weight: bold;">var</span> <span style="color: #7590db;">_</span> <span style="color: #4f97d7; font-weight: bold;">=</span> <span style="color: #7590db;">fmt</span>.<span style="color: #a45bad; font-style: italic;">Printf</span> <span style="color: #2aa1ae; background-color: #292e34;">// Just for the sake of how we're structuring things here we don't want to get an unused import error</span>
</pre>
</div>

<p>
Here there will actually be multiple channels
</p>

<ul class="org-ul">
<li><b>Channel that has written into it a sorted stream of numbers</b></li>
</ul>

<div class="org-src-container">
<pre class="src src-go" id="orgb2ac679"><span style="color: #4f97d7; font-weight: bold;">func</span> <span style="color: #bc6ec5; font-weight: bold;">emitSequentialNumbers</span><span style="color: #4f97d7;">(</span><span style="color: #7590db;">array</span> <span style="color: #bc6ec5;">[]</span><span style="color: #ce537a; font-weight: bold;">int</span><span style="color: #4f97d7;">)</span> <span style="color: #4f97d7; font-weight: bold;">&lt;-</span><span style="color: #4f97d7; font-weight: bold;">chan</span> <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #4f97d7;">{</span>
  <span style="color: #7590db;">c</span> <span style="color: #4f97d7; font-weight: bold;">:=</span> <span style="color: #4f97d7; font-weight: bold;">make</span><span style="color: #bc6ec5;">(</span><span style="color: #4f97d7; font-weight: bold;">chan</span> <span style="color: #ce537a; font-weight: bold;">int</span><span style="color: #bc6ec5;">)</span>

  <span style="color: #4f97d7; font-weight: bold;">go</span> <span style="color: #4f97d7; font-weight: bold;">func</span><span style="color: #bc6ec5;">()</span> <span style="color: #bc6ec5;">{</span>
    <span style="color: #4f97d7; font-weight: bold;">defer</span> <span style="color: #4f97d7; font-weight: bold;">close</span><span style="color: #2d9574;">(</span><span style="color: #7590db;">c</span><span style="color: #2d9574;">)</span>
    <span style="color: #7590db;">sortedArray</span> <span style="color: #4f97d7; font-weight: bold;">:=</span> <span style="color: #7590db;">slices</span>.<span style="color: #2aa1ae; font-weight: bold; font-style: italic;">Clone</span><span style="color: #2d9574;">(</span><span style="color: #7590db;">array</span><span style="color: #2d9574;">)</span>
    <span style="color: #7590db;">slices</span>.<span style="color: #2aa1ae; font-weight: bold; font-style: italic;">Sort</span><span style="color: #2d9574;">(</span><span style="color: #7590db;">sortedArray</span><span style="color: #2d9574;">)</span>

    <span style="color: #4f97d7; font-weight: bold;">for</span> <span style="color: #7590db;">_</span>, <span style="color: #7590db;">num</span> <span style="color: #4f97d7; font-weight: bold;">:=</span> <span style="color: #4f97d7; font-weight: bold;">range</span> <span style="color: #7590db;">sortedArray</span> <span style="color: #2d9574;">{</span>
      <span style="color: #7590db;">c</span> <span style="color: #4f97d7; font-weight: bold;">&lt;-</span> <span style="color: #7590db;">num</span>
    <span style="color: #2d9574;">}</span>
  <span style="color: #bc6ec5;">}()</span>

  <span style="color: #4f97d7; font-weight: bold;">return</span> <span style="color: #7590db;">c</span>
<span style="color: #4f97d7;">}</span>
</pre>
</div>

<p>
We should be able to use that
</p>
<div class="org-src-container">
<pre class="src src-go">



<span style="color: #4f97d7; font-weight: bold;">func</span> <span style="color: #bc6ec5; font-weight: bold;">arithmetic_progression</span><span style="color: #4f97d7;">()</span> <span style="color: #4f97d7;">{</span>
  <span style="color: #4f97d7; font-weight: bold;">for</span> <span style="color: #7590db;">val</span> <span style="color: #4f97d7; font-weight: bold;">:=</span> <span style="color: #4f97d7; font-weight: bold;">range</span> <span style="color: #2aa1ae; font-weight: bold;">emitSequentialNumbers</span><span style="color: #bc6ec5;">(</span><span style="color: #2d9574;">[]</span><span style="color: #ce537a; font-weight: bold;">int</span><span style="color: #2d9574;">{</span><span style="color: #a45bad;">3</span>, <span style="color: #4f97d7; font-weight: bold;">-</span><span style="color: #a45bad;">2</span>, <span style="color: #a45bad;">5</span>, <span style="color: #a45bad;">1</span><span style="color: #2d9574;">}</span><span style="color: #bc6ec5;">)</span> <span style="color: #bc6ec5;">{</span>
    <span style="color: #7590db;">fmt</span>.<span style="color: #2aa1ae; font-weight: bold; font-style: italic;">Println</span><span style="color: #2d9574;">(</span><span style="color: #7590db;">val</span><span style="color: #2d9574;">)</span>
  <span style="color: #bc6ec5;">}</span>
<span style="color: #4f97d7;">}</span>
</pre>
</div>

<p>
Sweet!
</p>

<hr />

<ul class="org-ul">
<li><p>
<b><b>Channel that has written into it deltas between sequential numbers</b></b>
</p></li>
</ul>
<div class="org-src-container">
<pre class="src src-go"><span style="color: #4f97d7; font-weight: bold;">func</span> <span style="color: #bc6ec5; font-weight: bold;">emitDeltasBetweenSequentialNumbers</span><span style="color: #4f97d7;">(</span><span style="color: #7590db;">sequentialNumbers</span> <span style="color: #4f97d7; font-weight: bold;">&lt;-</span><span style="color: #4f97d7; font-weight: bold;">chan</span> <span style="color: #ce537a; font-weight: bold;">int</span><span style="color: #4f97d7;">)</span> <span style="color: #4f97d7; font-weight: bold;">&lt;-</span><span style="color: #4f97d7; font-weight: bold;">chan</span> <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #4f97d7;">{</span>
  <span style="color: #7590db;">c</span><span style="color: #4f97d7; font-weight: bold;">:=</span> <span style="color: #4f97d7; font-weight: bold;">make</span><span style="color: #bc6ec5;">(</span><span style="color: #4f97d7; font-weight: bold;">chan</span> <span style="color: #ce537a; font-weight: bold;">int</span><span style="color: #bc6ec5;">)</span>
  <span style="color: #4f97d7; font-weight: bold;">go</span> <span style="color: #4f97d7; font-weight: bold;">func</span><span style="color: #bc6ec5;">()</span> <span style="color: #bc6ec5;">{</span>
    <span style="color: #4f97d7; font-weight: bold;">defer</span> <span style="color: #4f97d7; font-weight: bold;">close</span><span style="color: #2d9574;">(</span><span style="color: #7590db;">c</span><span style="color: #2d9574;">)</span>
    <span style="color: #4f97d7; font-weight: bold;">if</span> <span style="color: #7590db;">prevItem</span>, <span style="color: #7590db;">ok</span> <span style="color: #4f97d7; font-weight: bold;">:=</span> <span style="color: #4f97d7; font-weight: bold;">&lt;-</span> <span style="color: #7590db;">sequentialNumbers</span>; <span style="color: #7590db;">ok</span> <span style="color: #2d9574;">{</span>
      <span style="color: #4f97d7; font-weight: bold;">for</span> <span style="color: #7590db;">newItem</span> <span style="color: #4f97d7; font-weight: bold;">:=</span> <span style="color: #4f97d7; font-weight: bold;">range</span> <span style="color: #7590db;">sequentialNumbers</span> <span style="color: #67b11d;">{</span>
        <span style="color: #7590db;">c</span> <span style="color: #4f97d7; font-weight: bold;">&lt;-</span> <span style="color: #b1951d;">(</span><span style="color: #7590db;">newItem</span> <span style="color: #4f97d7; font-weight: bold;">-</span> <span style="color: #7590db;">prevItem</span><span style="color: #b1951d;">)</span>
        <span style="color: #7590db;">prevItem</span> <span style="color: #4f97d7; font-weight: bold;">=</span> <span style="color: #7590db;">newItem</span>

      <span style="color: #67b11d;">}</span>
    <span style="color: #2d9574;">}</span>
  <span style="color: #bc6ec5;">}()</span>
  <span style="color: #4f97d7; font-weight: bold;">return</span> <span style="color: #7590db;">c</span>
<span style="color: #4f97d7;">}</span>
</pre>
</div>
<p>
let's test that one
</p>

<p>
We should be able to use that
</p>
<div class="org-src-container">
<pre class="src src-go">





<span style="color: #4f97d7; font-weight: bold;">func</span> <span style="color: #bc6ec5; font-weight: bold;">arithmetic_progression</span><span style="color: #4f97d7;">()</span> <span style="color: #4f97d7;">{</span>
  <span style="color: #4f97d7; font-weight: bold;">for</span> <span style="color: #7590db;">val</span> <span style="color: #4f97d7; font-weight: bold;">:=</span> <span style="color: #4f97d7; font-weight: bold;">range</span> <span style="color: #2aa1ae; font-weight: bold;">emitDeltasBetweenSequentialNumbers</span><span style="color: #bc6ec5;">(</span><span style="color: #2aa1ae; font-weight: bold;">emitSequentialNumbers</span><span style="color: #2d9574;">(</span><span style="color: #67b11d;">[]</span><span style="color: #ce537a; font-weight: bold;">int</span><span style="color: #67b11d;">{</span><span style="color: #a45bad;">3</span>, <span style="color: #4f97d7; font-weight: bold;">-</span><span style="color: #a45bad;">2</span>, <span style="color: #a45bad;">5</span>, <span style="color: #a45bad;">1</span><span style="color: #67b11d;">}</span><span style="color: #2d9574;">)</span><span style="color: #bc6ec5;">)</span> <span style="color: #bc6ec5;">{</span>
    <span style="color: #7590db;">fmt</span>.<span style="color: #2aa1ae; font-weight: bold; font-style: italic;">Println</span><span style="color: #2d9574;">(</span><span style="color: #7590db;">val</span><span style="color: #2d9574;">)</span>
  <span style="color: #bc6ec5;">}</span>
<span style="color: #4f97d7;">}</span>
</pre>
</div>

<p>
That is indeed correct
</p>

<hr />

<ul class="org-ul">
<li><b><b>Signal-only channel that has written into it a signal which pops whether two sequential numbers have changed</b></b></li>
</ul>

<div class="org-src-container">
<pre class="src src-go" id="org63f21e6"><span style="color: #4f97d7; font-weight: bold;">func</span> <span style="color: #bc6ec5; font-weight: bold;">emitIfValueChanged</span><span style="color: #4f97d7;">[</span><span style="color: #7590db;">T</span> <span style="color: #ce537a; font-weight: bold;">comparable</span><span style="color: #4f97d7;">](</span><span style="color: #7590db;">values</span> <span style="color: #4f97d7; font-weight: bold;">&lt;-</span><span style="color: #4f97d7; font-weight: bold;">chan</span> <span style="color: #ce537a; font-weight: bold;">T</span><span style="color: #4f97d7;">)</span> <span style="color: #4f97d7; font-weight: bold;">&lt;-</span><span style="color: #4f97d7; font-weight: bold;">chan</span> <span style="color: #4f97d7; font-weight: bold;">struct</span><span style="color: #4f97d7;">{}</span> <span style="color: #4f97d7;">{</span>
  <span style="color: #7590db;">c</span><span style="color: #4f97d7; font-weight: bold;">:=</span> <span style="color: #4f97d7; font-weight: bold;">make</span><span style="color: #bc6ec5;">(</span><span style="color: #4f97d7; font-weight: bold;">chan</span> <span style="color: #4f97d7; font-weight: bold;">struct</span><span style="color: #2d9574;">{}</span><span style="color: #bc6ec5;">)</span>
  <span style="color: #4f97d7; font-weight: bold;">go</span> <span style="color: #4f97d7; font-weight: bold;">func</span><span style="color: #bc6ec5;">()</span> <span style="color: #bc6ec5;">{</span>
    <span style="color: #4f97d7; font-weight: bold;">defer</span> <span style="color: #4f97d7; font-weight: bold;">close</span><span style="color: #2d9574;">(</span><span style="color: #7590db;">c</span><span style="color: #2d9574;">)</span>
    <span style="color: #4f97d7; font-weight: bold;">if</span> <span style="color: #7590db;">firstItem</span>, <span style="color: #7590db;">ok</span> <span style="color: #4f97d7; font-weight: bold;">:=</span> <span style="color: #4f97d7; font-weight: bold;">&lt;-</span> <span style="color: #7590db;">values</span>; <span style="color: #7590db;">ok</span> <span style="color: #2d9574;">{</span>
      <span style="color: #4f97d7; font-weight: bold;">for</span> <span style="color: #7590db;">newItem</span> <span style="color: #4f97d7; font-weight: bold;">:=</span> <span style="color: #4f97d7; font-weight: bold;">range</span> <span style="color: #7590db;">values</span> <span style="color: #67b11d;">{</span>
        <span style="color: #4f97d7; font-weight: bold;">if</span><span style="color: #b1951d;">(</span><span style="color: #7590db;">newItem</span> <span style="color: #4f97d7; font-weight: bold;">!=</span> <span style="color: #7590db;">firstItem</span><span style="color: #b1951d;">)</span> <span style="color: #b1951d;">{</span>
          <span style="color: #7590db;">c</span> <span style="color: #4f97d7; font-weight: bold;">&lt;-</span> <span style="color: #4f97d7; font-weight: bold;">struct</span><span style="color: #4f97d7;">{}{}</span>
        <span style="color: #b1951d;">}</span>
      <span style="color: #67b11d;">}</span>
    <span style="color: #2d9574;">}</span>
  <span style="color: #bc6ec5;">}()</span>
  <span style="color: #4f97d7; font-weight: bold;">return</span> <span style="color: #7590db;">c</span>
<span style="color: #4f97d7;">}</span>
</pre>
</div>

<p>
Lets test this real quick
</p>

<div class="org-src-container">
<pre class="src src-go">





<span style="color: #4f97d7; font-weight: bold;">func</span> <span style="color: #bc6ec5; font-weight: bold;">main</span><span style="color: #4f97d7;">()</span> <span style="color: #4f97d7;">{</span>
  <span style="color: #4f97d7; font-weight: bold;">for</span> <span style="color: #4f97d7; font-weight: bold;">range</span> <span style="color: #2aa1ae; font-weight: bold;">emitIfValueChanged</span><span style="color: #bc6ec5;">(</span><span style="color: #2aa1ae; font-weight: bold;">emitSequentialNumbers</span><span style="color: #2d9574;">(</span><span style="color: #67b11d;">[]</span><span style="color: #ce537a; font-weight: bold;">int</span><span style="color: #67b11d;">{</span><span style="color: #a45bad;">0</span>, <span style="color: #a45bad;">0</span>, <span style="color: #a45bad;">0</span><span style="color: #67b11d;">}</span><span style="color: #2d9574;">)</span><span style="color: #bc6ec5;">)</span> <span style="color: #bc6ec5;">{</span>
    <span style="color: #7590db;">fmt</span>.<span style="color: #2aa1ae; font-weight: bold; font-style: italic;">Println</span><span style="color: #2d9574;">(</span><span style="color: #2d9574;">"got a change in the first loop"</span><span style="color: #2d9574;">)</span>
  <span style="color: #bc6ec5;">}</span>
  <span style="color: #4f97d7; font-weight: bold;">for</span> <span style="color: #4f97d7; font-weight: bold;">range</span> <span style="color: #2aa1ae; font-weight: bold;">emitIfValueChanged</span><span style="color: #bc6ec5;">(</span><span style="color: #2aa1ae; font-weight: bold;">emitSequentialNumbers</span><span style="color: #2d9574;">(</span><span style="color: #67b11d;">[]</span><span style="color: #ce537a; font-weight: bold;">int</span><span style="color: #67b11d;">{</span><span style="color: #a45bad;">0</span>, <span style="color: #a45bad;">0</span>, <span style="color: #a45bad;">1</span><span style="color: #67b11d;">}</span><span style="color: #2d9574;">)</span><span style="color: #bc6ec5;">)</span> <span style="color: #bc6ec5;">{</span>
    <span style="color: #7590db;">fmt</span>.<span style="color: #2aa1ae; font-weight: bold; font-style: italic;">Println</span><span style="color: #2d9574;">(</span><span style="color: #2d9574;">"got a change in the second loop"</span><span style="color: #2d9574;">)</span>
  <span style="color: #bc6ec5;">}</span>
<span style="color: #4f97d7;">}</span>
</pre>
</div>

<pre class="example">
got a change in the second loop
</pre>


<p>
Aha, interesting how the <code>_</code> variable was not only not necessary here, but actually didn't work
</p>

<hr />
<p>
Finally, lets actually create a function to return true/false here
</p>
<div class="org-src-container">
<pre class="src src-go"><span style="color: #4f97d7; font-weight: bold;">func</span> <span style="color: #bc6ec5; font-weight: bold;">IsArithmeticProgressionWithChannels</span><span style="color: #4f97d7;">(</span><span style="color: #7590db;">array</span> <span style="color: #bc6ec5;">[]</span><span style="color: #ce537a; font-weight: bold;">int</span><span style="color: #4f97d7;">)</span> <span style="color: #ce537a; font-weight: bold;">bool</span> <span style="color: #4f97d7;">{</span>
  <span style="color: #7590db;">_</span>, <span style="color: #7590db;">changed</span> <span style="color: #4f97d7; font-weight: bold;">:=</span> <span style="color: #4f97d7; font-weight: bold;">&lt;-</span><span style="color: #2aa1ae; font-weight: bold;">emitIfValueChanged</span><span style="color: #bc6ec5;">(</span><span style="color: #2aa1ae; font-weight: bold;">emitDeltasBetweenSequentialNumbers</span><span style="color: #2d9574;">(</span><span style="color: #2aa1ae; font-weight: bold;">emitSequentialNumbers</span><span style="color: #67b11d;">(</span><span style="color: #7590db;">array</span><span style="color: #67b11d;">)</span><span style="color: #2d9574;">)</span><span style="color: #bc6ec5;">)</span>
  <span style="color: #4f97d7; font-weight: bold;">return</span> <span style="color: #4f97d7; font-weight: bold;">!</span><span style="color: #7590db;">changed</span>
<span style="color: #4f97d7;">}</span>
</pre>
</div>
</div>
</div>
