can-make-arithmetic-progression/README.md


## Using channels

Ok, so hear me out, the above works just fine of course, but in other languages I would be using a generator or a stream to calculate the stream of deltas which I could then just compare one after the other, perhaps even generating another generator. With Go, the equivalent is to use channels. [Because of the semantics around closing them](https://stackoverflow.com/a/34466755/5056) hover it's not so straightforward and has higher overhead. Still, I would like to try and implement it as a learning exercise.

First some standard imports

    package main
    
    import (
      "fmt"
      "slices"
    )
    
    var _ = fmt.Printf // Just for the sake of how we're structuring things here we don't want to get an unused import error

Here there will actually be multiple channels

-   **Channel that has written into it a sorted stream of numbers**

    func emitSequentialNumbers(array []int) <-chan int {
      c := make(chan int)
    
      go func() {
        defer close(c)
        sortedArray := slices.Clone(array)
        slices.Sort(sortedArray)
    
        for _, num := range sortedArray {
          c <- num
        }
      }()
    
      return c
    }

We should be able to use that

    
    
    
    
    func arithmetic_progression() {
      for val := range emitSequentialNumbers([]int{3, -2, 5, 1}) {
        fmt.Println(val)
      }
    }

Sweet!

---

-   ****Channel that has written into it deltas between sequential numbers****

    func emitDeltasBetweenSequentialNumbers(sequentialNumbers <-chan int) <-chan int {
      c:= make(chan int)
      go func() {
        defer close(c)
        if prevItem, ok := <- sequentialNumbers; ok {
          for newItem := range sequentialNumbers {
            c <- (newItem - prevItem)
            prevItem = newItem
    
          }
        }
      }()
      return c
    }

let's test that one

We should be able to use that

    
    
    
    
    
    
    func arithmetic_progression() {
      for val := range emitDeltasBetweenSequentialNumbers(emitSequentialNumbers([]int{3, -2, 5, 1})) {
        fmt.Println(val)
      }
    }

That is indeed correct

---

-   ****Signal-only channel that has written into it a signal which pops whether two sequential numbers have changed****

    func emitIfValueChanged[T comparable](values <-chan T) <-chan struct{} {
      c:= make(chan struct{})
      go func() {
        defer close(c)
        if firstItem, ok := <- values; ok {
          for newItem := range values {
            if(newItem != firstItem) {
              c <- struct{}{}
            }
          }
        }
      }()
      return c
    }

Lets test this real quick

    
    
    
    
    
    
    func main() {
      for range emitIfValueChanged(emitSequentialNumbers([]int{0, 0, 0})) {
        fmt.Println("got a change in the first loop")
      }
      for range emitIfValueChanged(emitSequentialNumbers([]int{0, 0, 1})) {
        fmt.Println("got a change in the second loop")
      }
    }

    got a change in the second loop

Aha, interesting how the `_` variable was not only not necessary here, but actually didn't work

---

Finally, lets actually create a function to return true/false here

    func IsArithmeticProgressionWithChannels(array []int) bool {
      _, changed := <-emitIfValueChanged(emitDeltasBetweenSequentialNumbers(emitSequentialNumbers(array)))
      return !changed
    }
