can-make-arithmetic-progression/README.html
<div id="outline-container-orga28b2fa" class="outline-3">
<h3 id="orga28b2fa"><span class="section-number-3">3.4.</span> Channel implementation tests</h3>
<div class="outline-text-3" id="text-3-4">
<p>
Lets write some tests
</p>
<div class="org-src-container">
<pre class="src src-go"><span style="color: #4f97d7; font-weight: bold;">package</span> main


<span style="color: #4f97d7; font-weight: bold;">import</span> <span style="color: #4f97d7;">(</span>
  <span style="color: #2d9574;">"testing"</span>
<span style="color: #4f97d7;">)</span>

<span style="color: #4f97d7; font-weight: bold;">func</span> <span style="color: #bc6ec5; font-weight: bold;">TestIsArithmeticProgressionUsingChannels</span><span style="color: #4f97d7;">(</span><span style="color: #7590db;">t</span> <span style="color: #4f97d7; font-weight: bold;">*</span>testing.<span style="color: #ce537a; font-weight: bold;">T</span><span style="color: #4f97d7;">)</span> <span style="color: #4f97d7;">{</span>
  <span style="color: #7590db;">testCases</span> <span style="color: #4f97d7; font-weight: bold;">:=</span> <span style="color: #bc6ec5;">[]</span><span style="color: #4f97d7; font-weight: bold;">struct</span> <span style="color: #bc6ec5;">{</span>
    <span style="color: #a45bad; font-style: italic;">name</span>     <span style="color: #ce537a; font-weight: bold;">string</span>
    <span style="color: #a45bad; font-style: italic;">input</span>    <span style="color: #2d9574;">[]</span><span style="color: #ce537a; font-weight: bold;">int</span>
    <span style="color: #a45bad; font-style: italic;">expected</span> <span style="color: #ce537a; font-weight: bold;">bool</span>
  <span style="color: #bc6ec5;">}{</span>
    <span style="color: #2d9574;">{</span><span style="color: #2d9574;">"Example 1 - Valid progression"</span>, <span style="color: #67b11d;">[]</span><span style="color: #ce537a; font-weight: bold;">int</span><span style="color: #67b11d;">{</span><span style="color: #a45bad;">3</span>, <span style="color: #a45bad;">5</span>, <span style="color: #a45bad;">1</span><span style="color: #67b11d;">}</span>, <span style="color: #4f97d7;">true</span><span style="color: #2d9574;">}</span>,
    <span style="color: #2d9574;">{</span><span style="color: #2d9574;">"Example 2 - Invalid progression"</span>, <span style="color: #67b11d;">[]</span><span style="color: #ce537a; font-weight: bold;">int</span><span style="color: #67b11d;">{</span><span style="color: #a45bad;">1</span>, <span style="color: #a45bad;">2</span>, <span style="color: #a45bad;">4</span><span style="color: #67b11d;">}</span>, <span style="color: #4f97d7;">false</span><span style="color: #2d9574;">}</span>,
    <span style="color: #2d9574;">{</span><span style="color: #2d9574;">"Empty array"</span>, <span style="color: #67b11d;">[]</span><span style="color: #ce537a; font-weight: bold;">int</span><span style="color: #67b11d;">{}</span>, <span style="color: #4f97d7;">true</span><span style="color: #2d9574;">}</span>,
    <span style="color: #2d9574;">{</span><span style="color: #2d9574;">"Single element"</span>, <span style="color: #67b11d;">[]</span><span style="color: #ce537a; font-weight: bold;">int</span><span style="color: #67b11d;">{</span><span style="color: #a45bad;">5</span><span style="color: #67b11d;">}</span>, <span style="color: #4f97d7;">true</span><span style="color: #2d9574;">}</span>,
    <span style="color: #2d9574;">{</span><span style="color: #2d9574;">"Two elements"</span>, <span style="color: #67b11d;">[]</span><span style="color: #ce537a; font-weight: bold;">int</span><span style="color: #67b11d;">{</span><span style="color: #a45bad;">1</span>, <span style="color: #a45bad;">2</span><span style="color: #67b11d;">}</span>, <span style="color: #4f97d7;">true</span><span style="color: #2d9574;">}</span>,
    <span style="color: #2d9574;">{</span><span style="color: #2d9574;">"Negative numbers"</span>, <span style="color: #67b11d;">[]</span><span style="color: #ce537a; font-weight: bold;">int</span><span style="color: #67b11d;">{</span><span style="color: #4f97d7; font-weight: bold;">-</span><span style="color: #a45bad;">3</span>, <span style="color: #4f97d7; font-weight: bold;">-</span><span style="color: #a45bad;">1</span>, <span style="color: #a45bad;">1</span><span style="color: #67b11d;">}</span>, <span style="color: #4f97d7;">true</span><span style="color: #2d9574;">}</span>,
    <span style="color: #2d9574;">{</span><span style="color: #2d9574;">"Same numbers"</span>, <span style="color: #67b11d;">[]</span><span style="color: #ce537a; font-weight: bold;">int</span><span style="color: #67b11d;">{</span><span style="color: #a45bad;">2</span>, <span style="color: #a45bad;">2</span>, <span style="color: #a45bad;">2</span>, <span style="color: #a45bad;">2</span><span style="color: #67b11d;">}</span>, <span style="color: #4f97d7;">true</span><span style="color: #2d9574;">}</span>,
  <span style="color: #bc6ec5;">}</span>

  <span style="color: #4f97d7; font-weight: bold;">for</span> <span style="color: #7590db;">_</span>, <span style="color: #7590db;">tc</span> <span style="color: #4f97d7; font-weight: bold;">:=</span> <span style="color: #4f97d7; font-weight: bold;">range</span> <span style="color: #7590db;">testCases</span> <span style="color: #bc6ec5;">{</span>
    <span style="color: #7590db;">t</span>.<span style="color: #2aa1ae; font-weight: bold; font-style: italic;">Run</span><span style="color: #2d9574;">(</span><span style="color: #7590db;">tc</span>.<span style="color: #a45bad; font-style: italic;">name</span>, <span style="color: #4f97d7; font-weight: bold;">func</span><span style="color: #67b11d;">(</span><span style="color: #7590db;">t</span> <span style="color: #4f97d7; font-weight: bold;">*</span>testing.<span style="color: #ce537a; font-weight: bold;">T</span><span style="color: #67b11d;">)</span> <span style="color: #67b11d;">{</span>
      <span style="color: #7590db;">result</span> <span style="color: #4f97d7; font-weight: bold;">:=</span> <span style="color: #2aa1ae; font-weight: bold;">IsArithmeticProgressionWithChannels</span><span style="color: #b1951d;">(</span><span style="color: #7590db;">tc</span>.<span style="color: #a45bad; font-style: italic;">input</span><span style="color: #b1951d;">)</span>
      <span style="color: #4f97d7; font-weight: bold;">if</span> <span style="color: #7590db;">result</span> <span style="color: #4f97d7; font-weight: bold;">!=</span> <span style="color: #7590db;">tc</span>.<span style="color: #a45bad; font-style: italic;">expected</span> <span style="color: #b1951d;">{</span>
        <span style="color: #7590db;">t</span>.<span style="color: #2aa1ae; font-weight: bold; font-style: italic;">Errorf</span><span style="color: #4f97d7;">(</span><span style="color: #2d9574;">"IsArithmeticProgressionWithChannels(%v) = %v; want %v"</span>, <span style="color: #7590db;">tc</span>.<span style="color: #a45bad; font-style: italic;">input</span>, <span style="color: #7590db;">result</span>, <span style="color: #7590db;">tc</span>.<span style="color: #a45bad; font-style: italic;">expected</span><span style="color: #4f97d7;">)</span>
      <span style="color: #b1951d;">}</span>
    <span style="color: #67b11d;">}</span><span style="color: #2d9574;">)</span>
  <span style="color: #bc6ec5;">}</span>
<span style="color: #4f97d7;">}</span>
</pre>
</div>

<p>
We can then run all our tests to make sure they still work
</p>
<div class="org-src-container">
<pre class="src src-shell"><span style="color: #2aa1ae; font-weight: bold;">go</span> test <span style="color: #a45bad;">-v</span>
</pre>
</div>

<pre class="example" id="orge597a0e">
=== RUN   TestIsArithmeticProgression
=== RUN   TestIsArithmeticProgression/Example_1_-_Valid_progression
=== RUN   TestIsArithmeticProgression/Example_2_-_Invalid_progression
=== RUN   TestIsArithmeticProgression/Empty_array
=== RUN   TestIsArithmeticProgression/Single_element
=== RUN   TestIsArithmeticProgression/Two_elements
=== RUN   TestIsArithmeticProgression/Negative_numbers
=== RUN   TestIsArithmeticProgression/Same_numbers
--- PASS: TestIsArithmeticProgression (0.00s)
    --- PASS: TestIsArithmeticProgression/Example_1_-_Valid_progression (0.00s)
    --- PASS: TestIsArithmeticProgression/Example_2_-_Invalid_progression (0.00s)
    --- PASS: TestIsArithmeticProgression/Empty_array (0.00s)
    --- PASS: TestIsArithmeticProgression/Single_element (0.00s)
    --- PASS: TestIsArithmeticProgression/Two_elements (0.00s)
    --- PASS: TestIsArithmeticProgression/Negative_numbers (0.00s)
    --- PASS: TestIsArithmeticProgression/Same_numbers (0.00s)
=== RUN   TestIsArithmeticProgressionUsingChannels
=== RUN   TestIsArithmeticProgressionUsingChannels/Example_1_-_Valid_progression
=== RUN   TestIsArithmeticProgressionUsingChannels/Example_2_-_Invalid_progression
=== RUN   TestIsArithmeticProgressionUsingChannels/Empty_array
=== RUN   TestIsArithmeticProgressionUsingChannels/Single_element
=== RUN   TestIsArithmeticProgressionUsingChannels/Two_elements
=== RUN   TestIsArithmeticProgressionUsingChannels/Negative_numbers
=== RUN   TestIsArithmeticProgressionUsingChannels/Same_numbers
--- PASS: TestIsArithmeticProgressionUsingChannels (0.00s)
    --- PASS: TestIsArithmeticProgressionUsingChannels/Example_1_-_Valid_progression (0.00s)
    --- PASS: TestIsArithmeticProgressionUsingChannels/Example_2_-_Invalid_progression (0.00s)
    --- PASS: TestIsArithmeticProgressionUsingChannels/Empty_array (0.00s)
    --- PASS: TestIsArithmeticProgressionUsingChannels/Single_element (0.00s)
    --- PASS: TestIsArithmeticProgressionUsingChannels/Two_elements (0.00s)
    --- PASS: TestIsArithmeticProgressionUsingChannels/Negative_numbers (0.00s)
    --- PASS: TestIsArithmeticProgressionUsingChannels/Same_numbers (0.00s)
PASS
ok  	github.com/user/can-make-arithmetic-progression	0.001s
</pre>
</div>
</div>
</div>
</div>
</body>
</html>
