can-make-arithmetic-progression/README.md


## Channel implementation tests

Lets write some tests

    package main
    
    
    import (
      "testing"
    )
    
    func TestIsArithmeticProgressionUsingChannels(t *testing.T) {
      testCases := []struct {
        name     string
        input    []int
        expected bool
      }{
        {"Example 1 - Valid progression", []int{3, 5, 1}, true},
        {"Example 2 - Invalid progression", []int{1, 2, 4}, false},
        {"Empty array", []int{}, true},
        {"Single element", []int{5}, true},
        {"Two elements", []int{1, 2}, true},
        {"Negative numbers", []int{-3, -1, 1}, true},
        {"Same numbers", []int{2, 2, 2, 2}, true},
      }
    
      for _, tc := range testCases {
        t.Run(tc.name, func(t *testing.T) {
          result := IsArithmeticProgressionWithChannels(tc.input)
          if result != tc.expected {
            t.Errorf("IsArithmeticProgressionWithChannels(%v) = %v; want %v", tc.input, result, tc.expected)
          }
        })
      }
    }

We can then run all our tests to make sure they still work

    go test -v

    === RUN   TestIsArithmeticProgression
    === RUN   TestIsArithmeticProgression/Example_1_-_Valid_progression
    === RUN   TestIsArithmeticProgression/Example_2_-_Invalid_progression
    === RUN   TestIsArithmeticProgression/Empty_array
    === RUN   TestIsArithmeticProgression/Single_element
    === RUN   TestIsArithmeticProgression/Two_elements
    === RUN   TestIsArithmeticProgression/Negative_numbers
    === RUN   TestIsArithmeticProgression/Same_numbers
    --- PASS: TestIsArithmeticProgression (0.00s)
        --- PASS: TestIsArithmeticProgression/Example_1_-_Valid_progression (0.00s)
        --- PASS: TestIsArithmeticProgression/Example_2_-_Invalid_progression (0.00s)
        --- PASS: TestIsArithmeticProgression/Empty_array (0.00s)
        --- PASS: TestIsArithmeticProgression/Single_element (0.00s)
        --- PASS: TestIsArithmeticProgression/Two_elements (0.00s)
        --- PASS: TestIsArithmeticProgression/Negative_numbers (0.00s)
        --- PASS: TestIsArithmeticProgression/Same_numbers (0.00s)
    === RUN   TestIsArithmeticProgressionUsingChannels
    === RUN   TestIsArithmeticProgressionUsingChannels/Example_1_-_Valid_progression
    === RUN   TestIsArithmeticProgressionUsingChannels/Example_2_-_Invalid_progression
    === RUN   TestIsArithmeticProgressionUsingChannels/Empty_array
    === RUN   TestIsArithmeticProgressionUsingChannels/Single_element
    === RUN   TestIsArithmeticProgressionUsingChannels/Two_elements
    === RUN   TestIsArithmeticProgressionUsingChannels/Negative_numbers
    === RUN   TestIsArithmeticProgressionUsingChannels/Same_numbers
    --- PASS: TestIsArithmeticProgressionUsingChannels (0.00s)
        --- PASS: TestIsArithmeticProgressionUsingChannels/Example_1_-_Valid_progression (0.00s)
        --- PASS: TestIsArithmeticProgressionUsingChannels/Example_2_-_Invalid_progression (0.00s)
        --- PASS: TestIsArithmeticProgressionUsingChannels/Empty_array (0.00s)
        --- PASS: TestIsArithmeticProgressionUsingChannels/Single_element (0.00s)
        --- PASS: TestIsArithmeticProgressionUsingChannels/Two_elements (0.00s)
        --- PASS: TestIsArithmeticProgressionUsingChannels/Negative_numbers (0.00s)
        --- PASS: TestIsArithmeticProgressionUsingChannels/Same_numbers (0.00s)
    PASS
    ok  	github.com/user/can-make-arithmetic-progression	0.002s

